"Переменные"                
# переменные - это именнованные ссылки на ячейки памяти,
# где хрантся какие-то даные для дальнейшего использования,
# при обращении к названию переменной
num1 = 5
num2 = 10
print(num1 + num2)

"=================================Input and Output========================="
#input - Это функция которая помогает принимать данные с терминала
#output - Это функция которая помогает принимать данные с терминала
number = input("Введите число: ")
print("Введенное число: " + number)

"==========================Правила наименования переменных=================="
#Snake Case - python стиль написания переменных: Hello_World
#Camel Case - стиль написания в других языках программирования: HelloWorld

"=============================Типы данных Python==========================="
#================Неизменяемые типы данных====================
# Числовые данные = int, float
# Cтрочные данные = str
# Boolean = True or Folse
# none = None
# tuple = (1,2,3,4,5,6,7,8) не удаляемые списки

#===============Изменяемые типы данных===================
# list = [1,2,3,4,5,6,7,8,9] удаляемые списки
# set = {1,2,1,4} набор уникальных данных {1,2,4}
# dict = ('a':1, 'b':2, 'c':3)