"Переменные"                
# переменные - это именнованные ссылки на ячейки памяти,
# где хрантся какие-то даные для дальнейшего использования,
# при обращении к названию переменной
num1 = 5
num2 = 10
print(num1 + num2)

"=================================Input and Output========================="
#input - Это функция которая помогает принимать данные с терминала
#output - Это функция которая помогает принимать данные с терминала
number = input("Введите число: ")
print("Введенное число: " + number)

"==========================Правила наименования переменных=================="
num5=2
num5=3
print(num5)