"==================================Строки==============================="
#строки - неизменяемый тип данных, предназначенный для хранения текста 
# (последовательности символов)
string1 = "строка в одинарных кавычках"
string2 = "строка в двойных кавычках"
string3 = "Don't"
string4 = ' Study in "Makers Incubator"'
string5 = '''
Многострочный 
текст
тут можно использовать любые кавычки
'''

"===========================Экранизация строк==========================="
# '\n' - перенос на новую строку
#  't' - отступ (табуляция)
# '\\' - отоброжение \ 
#'r'  -  'hello\rw' - wello
#'w'  - лесенка(перенос на новую строку со смещением вправо на длину новой строки)

"===========================Индексы==========================="
# индекс - это порядковый номер начиная с нуля
# index = len(string) - 1 or =string[-1]

# срез - часть строки
# string[6:9] wor из hello world  

"==============================Форматирование строк=============================="
# title = 'Пирог'
# price = 35
# string =f'Название: {title}, цена: {price}'
# format1 = 'Название: %s, цена: %s'
# print (format1 %(title, price))

# format2 = 'Название: {}, цена: {}'
# print(format2.format(title,price))

"==============================Методы строк=============================="
# метод - это функция которая принадлежит определенному типу данных
# обращаемся к ней через точку 
# dir(str)  - посмотреть все доступные методы для данного типа данных
'''
'hello'.center(11) #'   hello   ' 
'hello'.center(11,'-') #'---hello---' 

'hello'.count('l') #2
'hello'.count('l'l) #1
'Hello'.count('hello') #0

'hello world'.split('') #['hello', 'world']
'hello world'.split('o') #['hell', ' w', 'rld']

' '.join(['hello', 'world']) #hello world
'%'.join(['hello', 'world']) #hello world
'hello world'.find('w') #6
'hello world'.find('o') #4
'hello world'.rfind('o') #7
'''
